pkwasniok/avr-db-template/lib/atpack/avrasm/inc/AVR32DU28def.inc
; CLKCTRL_MCLKCTRLA masks
.equ CLKCTRL_CLKSEL_gm = 0x07            ; Clock select group mask
.equ CLKCTRL_CLKSEL_gp = 0               ; Clock select group position
.equ CLKCTRL_CLKSEL_0_bm = (1<<0)        ; Clock select bit 0 mask
.equ CLKCTRL_CLKSEL_0_bp = 0             ; Clock select bit 0 position
.equ CLKCTRL_CLKSEL_1_bm = (1<<1)        ; Clock select bit 1 mask
.equ CLKCTRL_CLKSEL_1_bp = 1             ; Clock select bit 1 position
.equ CLKCTRL_CLKSEL_2_bm = (1<<2)        ; Clock select bit 2 mask
.equ CLKCTRL_CLKSEL_2_bp = 2             ; Clock select bit 2 position
.equ CLKCTRL_CLKOUT_bm = 0x80            ; System clock out bit mask
.equ CLKCTRL_CLKOUT_bp = 7               ; System clock out bit position

; CLKCTRL_MCLKCTRLB masks
.equ CLKCTRL_PEN_bm = 0x01               ; Prescaler enable bit mask
.equ CLKCTRL_PEN_bp = 0                  ; Prescaler enable bit position
.equ CLKCTRL_PDIV_gm = 0x1E              ; Prescaler division group mask
.equ CLKCTRL_PDIV_gp = 1                 ; Prescaler division group position
.equ CLKCTRL_PDIV_0_bm = (1<<1)          ; Prescaler division bit 0 mask
.equ CLKCTRL_PDIV_0_bp = 1               ; Prescaler division bit 0 position
.equ CLKCTRL_PDIV_1_bm = (1<<2)          ; Prescaler division bit 1 mask
.equ CLKCTRL_PDIV_1_bp = 2               ; Prescaler division bit 1 position
.equ CLKCTRL_PDIV_2_bm = (1<<3)          ; Prescaler division bit 2 mask
.equ CLKCTRL_PDIV_2_bp = 3               ; Prescaler division bit 2 position
.equ CLKCTRL_PDIV_3_bm = (1<<4)          ; Prescaler division bit 3 mask
.equ CLKCTRL_PDIV_3_bp = 4               ; Prescaler division bit 3 position

; CLKCTRL_MCLKCTRLC masks
.equ CLKCTRL_CFDEN_bm = 0x01             ; Clock Failure Detect Enable bit mask
.equ CLKCTRL_CFDEN_bp = 0                ; Clock Failure Detect Enable bit position
.equ CLKCTRL_CFDTST_bm = 0x02            ; Clock Failure Detect Test bit mask
.equ CLKCTRL_CFDTST_bp = 1               ; Clock Failure Detect Test bit position
.equ CLKCTRL_CFDSRC_gm = 0x0C            ; Clock Failure Detect Source group mask
.equ CLKCTRL_CFDSRC_gp = 2               ; Clock Failure Detect Source group position
.equ CLKCTRL_CFDSRC_0_bm = (1<<2)        ; Clock Failure Detect Source bit 0 mask
.equ CLKCTRL_CFDSRC_0_bp = 2             ; Clock Failure Detect Source bit 0 position
.equ CLKCTRL_CFDSRC_1_bm = (1<<3)        ; Clock Failure Detect Source bit 1 mask
.equ CLKCTRL_CFDSRC_1_bp = 3             ; Clock Failure Detect Source bit 1 position

; CLKCTRL_MCLKINTCTRL masks
.equ CLKCTRL_CFD_bm = 0x01               ; Clock Failure Detect Interrupt Enable bit mask
.equ CLKCTRL_CFD_bp = 0                  ; Clock Failure Detect Interrupt Enable bit position
.equ CLKCTRL_INTTYPE_bm = 0x80           ; Interrupt type bit mask
.equ CLKCTRL_INTTYPE_bp = 7              ; Interrupt type bit position

; CLKCTRL_MCLKINTFLAGS masks
; Masks for CLKCTRL_CFD already defined

; CLKCTRL_MCLKSTATUS masks
.equ CLKCTRL_SOSC_bm = 0x01              ; System Oscillator changing bit mask
.equ CLKCTRL_SOSC_bp = 0                 ; System Oscillator changing bit position
.equ CLKCTRL_OSCHFS_bm = 0x02            ; High frequency oscillator status bit mask
.equ CLKCTRL_OSCHFS_bp = 1               ; High frequency oscillator status bit position
.equ CLKCTRL_OSC32KS_bm = 0x04           ; 32KHz oscillator status bit mask
.equ CLKCTRL_OSC32KS_bp = 2              ; 32KHz oscillator status bit position
.equ CLKCTRL_XOSC32KS_bm = 0x08          ; 32.768 kHz Crystal Oscillator status bit mask
.equ CLKCTRL_XOSC32KS_bp = 3             ; 32.768 kHz Crystal Oscillator status bit position
.equ CLKCTRL_EXTS_bm = 0x10              ; External Clock status bit mask
.equ CLKCTRL_EXTS_bp = 4                 ; External Clock status bit position

; CLKCTRL_MCLKTIMEBASE masks
.equ CLKCTRL_TIMEBASE_gm = 0x1F          ; Timebase group mask
.equ CLKCTRL_TIMEBASE_gp = 0             ; Timebase group position
.equ CLKCTRL_TIMEBASE_0_bm = (1<<0)      ; Timebase bit 0 mask
.equ CLKCTRL_TIMEBASE_0_bp = 0           ; Timebase bit 0 position
.equ CLKCTRL_TIMEBASE_1_bm = (1<<1)      ; Timebase bit 1 mask
.equ CLKCTRL_TIMEBASE_1_bp = 1           ; Timebase bit 1 position
.equ CLKCTRL_TIMEBASE_2_bm = (1<<2)      ; Timebase bit 2 mask
.equ CLKCTRL_TIMEBASE_2_bp = 2           ; Timebase bit 2 position
.equ CLKCTRL_TIMEBASE_3_bm = (1<<3)      ; Timebase bit 3 mask
.equ CLKCTRL_TIMEBASE_3_bp = 3           ; Timebase bit 3 position
.equ CLKCTRL_TIMEBASE_4_bm = (1<<4)      ; Timebase bit 4 mask
.equ CLKCTRL_TIMEBASE_4_bp = 4           ; Timebase bit 4 position

; CLKCTRL_OSCHFCTRLA masks
.equ CLKCTRL_AUTOTUNE_gm = 0x03          ; Autotune group mask
.equ CLKCTRL_AUTOTUNE_gp = 0             ; Autotune group position
.equ CLKCTRL_AUTOTUNE_0_bm = (1<<0)      ; Autotune bit 0 mask
.equ CLKCTRL_AUTOTUNE_0_bp = 0           ; Autotune bit 0 position
.equ CLKCTRL_AUTOTUNE_1_bm = (1<<1)      ; Autotune bit 1 mask
.equ CLKCTRL_AUTOTUNE_1_bp = 1           ; Autotune bit 1 position
.equ CLKCTRL_FRQSEL_gm = 0x3C            ; Frequency select group mask
.equ CLKCTRL_FRQSEL_gp = 2               ; Frequency select group position
.equ CLKCTRL_FRQSEL_0_bm = (1<<2)        ; Frequency select bit 0 mask
.equ CLKCTRL_FRQSEL_0_bp = 2             ; Frequency select bit 0 position
.equ CLKCTRL_FRQSEL_1_bm = (1<<3)        ; Frequency select bit 1 mask
.equ CLKCTRL_FRQSEL_1_bp = 3             ; Frequency select bit 1 position
.equ CLKCTRL_FRQSEL_2_bm = (1<<4)        ; Frequency select bit 2 mask
.equ CLKCTRL_FRQSEL_2_bp = 4             ; Frequency select bit 2 position
.equ CLKCTRL_FRQSEL_3_bm = (1<<5)        ; Frequency select bit 3 mask
.equ CLKCTRL_FRQSEL_3_bp = 5             ; Frequency select bit 3 position
.equ CLKCTRL_ALGSEL_bm = 0x40            ; Algorithm Selection bit mask
.equ CLKCTRL_ALGSEL_bp = 6               ; Algorithm Selection bit position
.equ CLKCTRL_RUNSTDBY_bm = 0x80          ; Run standby bit mask
.equ CLKCTRL_RUNSTDBY_bp = 7             ; Run standby bit position

; CLKCTRL_OSCHFTUNE masks
.equ CLKCTRL_TUNE_gm = 0x7F              ; Tune group mask
.equ CLKCTRL_TUNE_gp = 0                 ; Tune group position
.equ CLKCTRL_TUNE_0_bm = (1<<0)          ; Tune bit 0 mask
.equ CLKCTRL_TUNE_0_bp = 0               ; Tune bit 0 position
.equ CLKCTRL_TUNE_1_bm = (1<<1)          ; Tune bit 1 mask
.equ CLKCTRL_TUNE_1_bp = 1               ; Tune bit 1 position
.equ CLKCTRL_TUNE_2_bm = (1<<2)          ; Tune bit 2 mask
.equ CLKCTRL_TUNE_2_bp = 2               ; Tune bit 2 position
.equ CLKCTRL_TUNE_3_bm = (1<<3)          ; Tune bit 3 mask
.equ CLKCTRL_TUNE_3_bp = 3               ; Tune bit 3 position
.equ CLKCTRL_TUNE_4_bm = (1<<4)          ; Tune bit 4 mask
.equ CLKCTRL_TUNE_4_bp = 4               ; Tune bit 4 position
.equ CLKCTRL_TUNE_5_bm = (1<<5)          ; Tune bit 5 mask
.equ CLKCTRL_TUNE_5_bp = 5               ; Tune bit 5 position
.equ CLKCTRL_TUNE_6_bm = (1<<6)          ; Tune bit 6 mask
.equ CLKCTRL_TUNE_6_bp = 6               ; Tune bit 6 position

; CLKCTRL_OSCHFSTATUS masks
.equ CLKCTRL_ATSYNC_bm = 0x01            ; Autotune in Lock bit mask
.equ CLKCTRL_ATSYNC_bp = 0               ; Autotune in Lock bit position
.equ CLKCTRL_ATLOCK_bm = 0x02            ; Autotune Synchronized bit mask
.equ CLKCTRL_ATLOCK_bp = 1               ; Autotune Synchronized bit position

; CLKCTRL_OSC32KCTRLA masks
; Masks for CLKCTRL_RUNSTDBY already defined

; CLKCTRL_XOSC32KCTRLA masks
.equ CLKCTRL_ENABLE_bm = 0x01            ; Enable bit mask
.equ CLKCTRL_ENABLE_bp = 0               ; Enable bit position
.equ CLKCTRL_LPMODE_bm = 0x02            ; Low power mode bit mask
.equ CLKCTRL_LPMODE_bp = 1               ; Low power mode bit position
.equ CLKCTRL_SEL_bm = 0x04               ; Select bit mask
.equ CLKCTRL_SEL_bp = 2                  ; Select bit position
.equ CLKCTRL_CSUT_gm = 0x30              ; Crystal startup time group mask
.equ CLKCTRL_CSUT_gp = 4                 ; Crystal startup time group position
.equ CLKCTRL_CSUT_0_bm = (1<<4)          ; Crystal startup time bit 0 mask
.equ CLKCTRL_CSUT_0_bp = 4               ; Crystal startup time bit 0 position
.equ CLKCTRL_CSUT_1_bm = (1<<5)          ; Crystal startup time bit 1 mask
.equ CLKCTRL_CSUT_1_bp = 5               ; Crystal startup time bit 1 position
; Masks for CLKCTRL_RUNSTDBY already defined

